{"title": "Cody Ko Finally Responds to Allegations for Sexually Assaulting a Minor", "link": "/article/cody-ko-finally-responds-to-allegations-for-sexually-assaulting-a-minor", "author": "PajamaJohn", "date": "2024-07-29", "content": "Los Angeles – TMG (Tiny Meat Gang) Studios has finally put out a statement regarding the sexual assault allegations on founder Cody Ko, brought forth by Tana Mongeau a few weeks ago.\r\n\r\nThe statement, nested in a subpage of the TMG Studios website states that Cody will no longer be a part of the day to day operations of the studio. There is no further apology, or response to the allegation.\r\n\r\nThe statement comes after Tana Mongeau accused Cody Ko of engaging in sexual acts with her when she was 17 years-old. Cody was 25 at the time. The allegations were brought forth on Tana’s podcast Canceled.\r\n\r\n“I’ll say the statement, for me, was surprising.” said Ethan.\r\n\r\nBut, the apology seems to be extremely impersonal, and does not address the main issue at hand, the allegations made on Cody Ko.\r\n\r\n“Yeah they didn’t acknowledge anything. It’s actually pretty stunning.” said Ethan.\r\n\r\nCo founder of TMG Studios, Noel Miller, will continue to lead the studio and its productions. It also seems that Cody is still in ownership of the company.\r\n\r\n“It’s hyper separating the brand from Cody, when Cody is so infused into the brand.” said Olivia.\r\n\r\nEthan and the crew later watch a seven year-old clip of Cody Ko and Adam22 talk in detail about Tana.\r\n\r\nIn the clip, they talk in detail about their predatory relationships and how much they love Tana Mongeau. Saying they would date her. \r\n\r\nTo see more about the Cody Ko allegations on the H3 show click here https://www.youtube.com/live/8r5HosJI4bk?si=gTPA4BR43k_h5mtW&t=3297\r\n", "youtube": "", "tags": ["Cody Ko", "Tana Mongeau", "Ethan", "EP35", "SA", "Drama", "Apology", "Olivia"], "thumbnail": "static/uploads/7-29_Cody_Ko_responds.png"}